nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso51u68/cmsis_driver_examples/gpio/button_toggle_led/pin_mux.h
/*
 * Copyright  2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_


/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOCON_PIO_DIGITAL_EN                                               0x80u   /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0                                                    0x00u   /*!<@brief Selects pin function 0 */
#define IOCON_PIO_I2CDRIVE_LOW                                             0x00u   /*!<@brief Low drive: 4 mA */
#define IOCON_PIO_I2CFILTER_EN                                             0x00u   /*!<@brief I2C 50 ns glitch filter enabled */
#define IOCON_PIO_I2CSLEW_GPIO                                             0x20u   /*!<@brief GPIO mode */
#define IOCON_PIO_INPFILT_OFF                                            0x0100u   /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI                                                   0x00u   /*!<@brief Input function is not inverted */
#define PINTSEL0_IDX                                                          0u   /*!<@brief Inputmux PINTSEL register index 0 */

/*! @name PIO0_24 (number 2), J4[10]/JS2[1]/JS5[3]/U10[5]/U12[E6]/SW1/BRIDGE_SDA-WAKEUP */

/* Symbols to be used with GPIO driver */
#define BOARD_SW1_GPIO                                                      GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW1_GPIO_PIN_MASK                                      (1U << 24U)   /*!<@brief GPIO pin mask */
#define BOARD_SW1_PORT                                                        0U   /*!<@brief PORT device index: 0 */
#define BOARD_SW1_PIN                                                        24U   /*!<@brief PORT pin number */
#define BOARD_SW1_PIN_MASK                                           (1U << 24U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSW1(void); /* Function assigned for the Cortex-M0P */

#define IOCON_PIO_DIGITAL_EN                                               0x80u   /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0                                                    0x00u   /*!<@brief Selects pin function 0 */
#define IOCON_PIO_INPFILT_OFF                                            0x0100u   /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI                                                   0x00u   /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_PULLUP                                              0x10u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI                                             0x00u   /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD                                            0x00u   /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO1_9 (number 29), J9[5]/D2[3]/P1_9-BLUE_LED */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_BLUE_GPIO                                                 GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_BLUE_GPIO_PIN_MASK                                  (1U << 9U)   /*!<@brief GPIO pin mask */
#define BOARD_LED_BLUE_PORT                                                   1U   /*!<@brief PORT device index: 1 */
#define BOARD_LED_BLUE_PIN                                                    9U   /*!<@brief PORT pin number */
#define BOARD_LED_BLUE_PIN_MASK                                       (1U << 9U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDBlue(void); /* Function assigned for the Cortex-M0P */

#define IOCON_PIO_DIGITAL_EN                                               0x80u   /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC1                                                    0x01u   /*!<@brief Selects pin function 1 */
#define IOCON_PIO_INPFILT_OFF                                            0x0100u   /*!<@brief Input filter disabled */
#define IOCON_PIO_INV_DI                                                   0x00u   /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT                                               0x00u   /*!<@brief No addition pin function */
#define IOCON_PIO_OPENDRAIN_DI                                             0x00u   /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD                                            0x00u   /*!<@brief Standard mode, output slew rate control is enabled */
#define PIO01_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO01_FILTEROFF_DISABLED                                           0x01u   /*!<@brief Controls input glitch filter.: Filter disabled. No input filtering is done. */
#define PIO01_FUNC_ALT1                                                    0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO01_MODE_INACTIVE                                                0x00u   /*!<@brief Selects function mode (on-chip pull-up/pull-down resistor control).: Inactive. Inactive (no pull-down/pull-up resistor enabled). */
#define PIO01_OD_NORMAL                                                    0x00u   /*!<@brief Controls open-drain mode.: Normal. Normal push-pull output */
#define PIO01_SLEW_STANDARD                                                0x00u   /*!<@brief Driver slew rate.: Standard mode, output slew rate control is enabled. More outputs can be switched simultaneously. */

/*! @name FC0_TXD_SCL_MISO (number 32), U6[4]/U22[3]/P0_1-ISP_TX */
#define BOARD_DEBUG_UART_TX_PORT                                              0U   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_UART_TX_PIN                                               1U   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK                                  (1U << 1U)   /*!<@brief PORT pin mask */

/*! @name FC0_RXD_SDA_MOSI (number 31), U18[4]/TO_MUX_P0_0-ISP_RX */
#define BOARD_DEBUG_UART_RX_PORT                                              0U   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_UART_RX_PIN                                               0U   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK                                  (1U << 0U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
